Revit 2027 API
Connector.GetFabricationConnectorInfo Method
 Gets fabrication connectivity information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationConnectorInfo GetFabricationConnectorInfo()
Public Function GetFabricationConnectorInfo As FabricationConnectorInfo
public:
FabricationConnectorInfo^ GetFabricationConnectorInfo()
member GetFabricationConnectorInfo : unit -> FabricationConnectorInfo
Return Value
FabricationConnectorInfo
 Returns null if there is no fabrication connector information associated.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace